MichelRottleuthner/RIOT/cpu/stm32/gclk/gclk_stm32l4.c
/*
 * Copyright (C) 2020 HAW Hamburg
 *
 * This file is subject to the terms and conditions of the GNU Lesser
 * General Public License v2.1. See the file LICENSE in the top level
 * directory for more details.
 */

/**
 * @ingroup     cpu_stm32_common
 * @{
 *
 * @file
 * @brief       STM32L4-specific declarations for the gclk module
 *
 * @todo        HSI48 (RC48) that is only present on STM32L49x/L4Ax is missing
 *
 * @author      Michel Rottleuthner <michel.rottleuthner@haw-hamburg.de>
 * @}
 */
#include <stdint.h>
#include <stddef.h>

#include "cpu.h" /* pulls in the RCC register definitions etc. from the relevant vendor header */
#include "board.h" /* needed for crystal clock defines */

#include <stdio.h>
#include "gclk.h"
#include "gclk/generic_gate.h"
#include "gclk/generic_mux.h"
#include "gclk/generic_scaler.h"

#define STM32_L476RG_MCO_PIN (GPIO_PIN(0,8))
#define STM32_L476RG_MCO_AF  (GPIO_AF0)

#if defined(CPU_FAM_STM32L4)
/* The number of regsiters involved in clock configuration is usually pretty small.
   We can exploit that to save some memory by only holding the configuration registers in one place and storing only a
   tiny index to it in each instance
   @todo: evaluate if we can link conditional availability between these values and instances to use the same knob for
          enabling/disabling availability/required state */
typedef enum {
    GCLK_NULL_REG = 0,
    GCLK_STM32_RCC_CR,
    GCLK_STM32_RCC_CSR,
    GCLK_STM32_RCC_BDCR,
    GCLK_STM32_RCC_CFGR,
    GCLK_STM32_RCC_CCIPR,
    GCLK_STM32_RCC_PLLCFGR,
    GCLK_STM32_RCC_PLLSAI1CFGR,
    GCLK_STM32_RCC_PLLSAI2CFGR,
    GCLK_STM32_RCC_APB1ENR1,
    GCLK_STM32_RCC_APB1ENR2,
    GCLK_STM32_RCC_APB2ENR,
    GCLK_STM32_RCC_AHB2ENR,
    /* @todo: add unused entry at the end to derive count? */
} gclk_conf_reg_id_t;
#elif defined(CPU_FAM_STM32L0)
typedef enum {
    GCLK_NULL_REG = 0,
    GCLK_STM32_RCC_CR,
    GCLK_STM32_RCC_CSR,
    GCLK_STM32_RCC_CFGR,
    GCLK_STM32_RCC_CCIPR,
    GCLK_STM32_RCC_CRRCR,
    GCLK_STM32_RCC_ICSCR,
} gclk_conf_reg_id_t;
#else
#error "must specify gclk conf reg ids for this platform!"
#endif /* defined(CPU_FAM_STM32L4) */

/* compatibility taken from stmclock for now
 * since stmclock solves a similar issue this should be a good baseline for testing and comparison.
 * For now this is only tested on STM32L476 */
#if defined(CPU_FAM_STM32L4)
#else
#error gclk not supportet on this STM32 chip!
#endif /* defined(CPU_FAM_STM32L4) */

/* @todo: declare this externally (board specific configuration header + single include in here + getters ?)*/
volatile uint32_t* const conf_regs[] = {
    [GCLK_NULL_REG]              = NULL,
    [GCLK_STM32_RCC_CR]          = &RCC->CR,
    [GCLK_STM32_RCC_CSR]         = &RCC->CSR,
    [GCLK_STM32_RCC_BDCR]        = &RCC->BDCR,
    [GCLK_STM32_RCC_CFGR]        = &RCC->CFGR,
    [GCLK_STM32_RCC_CCIPR]       = &RCC->CCIPR,
    [GCLK_STM32_RCC_PLLCFGR]     = &RCC->PLLCFGR,
    [GCLK_STM32_RCC_PLLSAI1CFGR] = &RCC->PLLSAI1CFGR,
    [GCLK_STM32_RCC_PLLSAI2CFGR] = &RCC->PLLSAI2CFGR,
    [GCLK_STM32_RCC_APB1ENR1]    = &RCC->APB1ENR1,
    [GCLK_STM32_RCC_APB1ENR2]    = &RCC->APB1ENR2,
    [GCLK_STM32_RCC_APB2ENR]     = &RCC->APB2ENR,
    [GCLK_STM32_RCC_AHB2ENR]     = &RCC->AHB2ENR,
};

#if defined(CPU_FAM_STM32L4) || defined(CPU_FAM_STM32F7) || \
    defined(CPU_FAM_STM32WB)
#define REG_PWR_CR          CR1
#define BIT_CR_DBP          PWR_CR1_DBP
#else
#define REG_PWR_CR          CR
#define BIT_CR_DBP          PWR_CR_DBP
#endif

/* compatibility taken from stmclock for now
 * since stmclock solves a similar issue this should be a good baseline for testing and comparison.
 * For now this is only tested on STM32L476 */
 #if defined(CPU_FAM_STM32L4)
 /* implemented agains reference manual RM0367 i.e, STM32L0x3 */
 #elif defined(CPU_LINE_STM32L073xx) || defined(CPU_LINE_STM32L053xx)
 #pragma message("gclk not fully tested on this STM32 chip!")
 #else
 #error gclk not supportet on this STM32 chip!
 #endif /* defined(CPU_FAM_STM32L4) */

/* forward declare clock instances to reference them in other clocks */
const gclk_generic_gate_t gclk_stm32_msi_gate;
const gclk_generic_gate_t gclk_stm32_tim5_gate;
const gclk_t gclk_stm32_sai1_ext;
const gclk_t gclk_stm32_sai2_ext;
const gclk_mux_ll_t gclk_stm32_sysclk_mux;
const gclk_mux_ll_t gclk_stm32_msi_mux;
const gclk_mux_ll_t gclk_stm32_usb_rng_sdmmc_mux;
const gclk_mux_ll_t gclk_stm32_lsco_mux;
const gclk_mux_ll_t gclk_stm32_rtc_lcd_mux;
const gclk_mux_ll_t gclk_stm32_pll_pre_div_mux;
const gclk_mux_ll_t gclk_stm32_sai1_mux;
const gclk_mux_ll_t gclk_stm32_sai2_mux;
const gclk_mux_ll_t gclk_stm32_mco_mux;
const gclk_mux_ll_t gclk_stm32_adc_mux;
const gclk_mux_ll_t gclk_stm32_i2c1_mux;
const gclk_mux_ll_t gclk_stm32_i2c2_mux;
const gclk_mux_ll_t gclk_stm32_i2c3_mux;
const gclk_mux_ll_t gclk_stm32_dfsdm1_mux;
const gclk_mux_ll_t gclk_stm32_lpuart1_mux;
const gclk_mux_ll_t gclk_stm32_uart5_mux;
const gclk_mux_ll_t gclk_stm32_uart4_mux;
const gclk_mux_ll_t gclk_stm32_usart3_mux;
const gclk_mux_ll_t gclk_stm32_usart2_mux;
const gclk_mux_ll_t gclk_stm32_usart1_mux;
const gclk_mux_ll_t gclk_stm32_swpmi1_mux;
const gclk_mux_ll_t gclk_stm32_lptim1_mux;
const gclk_mux_ll_t gclk_stm32_lptim2_mux;
const gclk_clk_scaler_ll_t gclk_stm32_ahb_scaler;
const gclk_clk_scaler_ll_t gclk_stm32_apb1_scaler;
const gclk_clk_scaler_ll_t gclk_stm32_apb2_scaler;
const gclk_clk_scaler_ll_t gclk_stm32_pll_m_scaler;
const gclk_clk_scaler_ll_t gclk_stm32_pll_p_scaler;
const gclk_clk_scaler_ll_t gclk_stm32_pllsai1_p_scaler;
const gclk_clk_scaler_ll_t gclk_stm32_pllsai2_p_scaler;
const gclk_clk_scaler_ll_t gclk_stm32_pll_p_scaler;
const gclk_clk_scaler_ll_t gclk_stm32_pllsai1_p_scaler;
const gclk_clk_scaler_ll_t gclk_stm32_pllsai2_p_scaler;
const gclk_clk_scaler_ll_t gclk_stm32_pll_q_scaler;
const gclk_clk_scaler_ll_t gclk_stm32_pll_r_scaler;
const gclk_clk_scaler_ll_t gclk_stm32_pllsai1_q_scaler;
const gclk_clk_scaler_ll_t gclk_stm32_pllsai1_r_scaler;
const gclk_clk_scaler_ll_t gclk_stm32_pllsai2_r_scaler;
const gclk_clk_scaler_ll_t gclk_stm32_pll_vco_scaler;
const gclk_clk_scaler_ll_t gclk_stm32_pllsai1_vco_scaler;
const gclk_clk_scaler_ll_t gclk_stm32_pllsai2_vco_scaler;
const gclk_clk_scaler_ll_t gclk_apb1_tim_mul_scaler;
const gclk_clk_scaler_ll_t gclk_apb2_tim_mul_scaler;
const gclk_clk_scaler_ll_t gclk_stm32_hse_div32_scaler;
const gclk_clk_scaler_ll_t gclk_stm32_ahb_div8_scaler;
const gclk_clk_scaler_ll_t gclk_stm32_msirange_scaler;
const gclk_clk_scaler_ll_t gclk_stm32_msisrange_scaler;
const gclk_clk_scaler_ll_t gclk_stm32_mco_div_scaler;

/* wraps the basic gate function with logic to unlock/lock backup domain write protection */
static void _bdcr_gate_enable(const gclk_t *clk, bool on) {
    PWR->REG_PWR_CR |= BIT_CR_DBP; /* < disable write protection first */

    gclk_generic_gate_ed_rdy_reg_enable(clk, on);

    PWR->REG_PWR_CR &= ~(BIT_CR_DBP); /* < enable write protection again */
}

