MichelRottleuthner/RIOT/cpu/stm32/gclk/gclk_stm32l4.c
/* A driver that implements just the gate_ops interface.
 * For the is_enabled i.e. (read-only) operation it reuses the generic gate
 * implementation. The enable function that writes to hardware wraps the
 * basic gate driver with code that enables/disables the backup domain write
 * protection.
 **/
static const gclk_op_t _bdcr_gate_ops[] = {
  { .gate_ops = { .is_enabled = gclk_generic_gate_ed_rdy_reg_is_enabled,
                  .enable     = _bdcr_gate_enable,}},
};

/* wraps the basic mux function with logic to unlock/lock backup domain write protection */
static void _bdcr_mux_set_parent(const gclk_t *clk, unsigned int index)
{
    /* TODO: to not interfere with other thigs that access the backup domain
     *       this should be guarded to only disable/enable if it acutally is enabled
     *       to avoid enabling a previously disabled baclup domain */
    PWR->REG_PWR_CR |= BIT_CR_DBP; /* < disable write protection first */

    gclk_plain_mux_set_parent(clk, index);

    PWR->REG_PWR_CR &= ~(BIT_CR_DBP); /* < enable write protection again */
}

/* A driver that implements the mux_ops and gate_ops interface for a gateable mux
 * that requires backup domain lock/unlock.
 * For read-only functions it reuses the functions of the base drivers.
 * For write functions it uses custom implementations that simply wraps the
 * base function with backup domain protection enable/disable.
 **/
static const gclk_op_t _bdcr_basic_muxable_gate_ops[] = {
  { .mux_ops  = { .get_parent = gclk_plain_mux_get_parent,
                  .set_parent = _bdcr_mux_set_parent,}},
  { .gate_ops = { .is_enabled = gclk_generic_gate_ed_rdy_reg_is_enabled,
                  .enable     = _bdcr_gate_enable,}},
};

#define _GATEABLE_BDCR_MUX_STATIC_INIT(NAME,CONF_REG_ID,CONF_REG_MASK,ENABLE_REG_ID,ENABLE_BIT)\
.base.separated_ops  = _bdcr_basic_muxable_gate_ops,\
.base.flags.muxable  = 1,\
.base.flags.gateable = 1,\
.base.name           = #NAME,\
.regref                  = { .conf     = CONF_REG_ID,\
                             .conf_lsb = STATIC_BITMASK_LSB(CONF_REG_MASK),\
                             .conf_msb = STATIC_BITMASK_MSB(CONF_REG_MASK),\
                             .en       = ENABLE_REG_ID,\
                             .en_bit   = ENABLE_BIT,}

//const gclk_ops_t gclk_stm32_common_gate_ops = {
//    .enable = gclk_stm32_common_xx_gate_enable,
//    .set_parent = NULL, /* not applicable to pure gates */
//    .get_parent = NULL, /* a pure gate can not be configured to different parents (otherwise it would be a mux). So it
//                           is never appliccable to have a dynamic parent. Static parents are handled by the higher
//                           user facing API */
//    .set_freq = NULL,   /* not applicable for a gate */
//    .get_freq = gclk_generic_gate_get_freq,   /* returns 0 if off (gated) or the parent freq */
//    .check_freq = gclk_generic_gate_check_freq,
//};

//const gclk_ops_t gclk_stm32_common_src_gate_ops = {
//    .enable = gclk_stm32_common_xx_gate_enable,
//    .set_parent = NULL, /* not applicable to pure gates */
//    .get_parent = NULL, /* a pure gate can not be configured to different parents (otherwise it would be a mux). So it
//                           is never appliccable to have a dynamic parent. Static parents are handled by the higher
//                           user facing API */
//    .set_freq = NULL,   /* not applicable for a gate */
//    .get_freq = gclk_generic_src_gate_get_freq,  /* returns 0 if off (gated) or the fixed source freq */
//    .check_freq = gclk_generic_gate_src_check_freq,
//};

//TODO: move out to generic gate header
/* initializes a basic gate that acts as a fixed frequency source */
#define _BASIC_SOURCE_GATE_STATIC_INIT(NAME,FIXFREQ,EN_REG_ID,RDY_REG_ID,EN_BIT,RDY_BIT)\
.base.separated_ops    = gclk_plain_gate_ops,\
.base.fixed_input_freq = FIXFREQ,\
.base.flags.is_source  = 1,\
.base.flags.gateable   = 1,\
.base.name             = #NAME,\
.regref                = { .en      = EN_REG_ID,\
                           .rdy     = RDY_REG_ID,\
                           .en_bit  = EN_BIT,\
                           .rdy_bit = RDY_BIT, }

/* gates that act as a clock source that always has a fixed frequency that is either enabled or disabled */
const gclk_generic_gate_t gclk_stm32_hsi16_gate = {
_BASIC_SOURCE_GATE_STATIC_INIT(HSI16,
                               16000000,
                               GCLK_STM32_RCC_CR,
                               GCLK_STM32_RCC_CR,
                               RCC_CR_HSION_Pos,
                               RCC_CR_HSIRDY_Pos),
};

/* @todo: HSE has board specific (HW configured) rate */
const gclk_generic_gate_t gclk_stm32_hse_gate = {
#if IS_ACTIVE(CONFIG_BOARD_HAS_HSE)
_BASIC_SOURCE_GATE_STATIC_INIT(HSE,
                               CLOCK_HSE,
                               GCLK_STM32_RCC_CR,
                               GCLK_STM32_RCC_CR,
                               RCC_CR_HSEON_Pos,
                               RCC_CR_HSERDY_Pos),
#else
.base.separated_ops    = NULL,
.base.fixed_input_freq = 0,
.base.flags.is_source  = 1,
.base.flags.gateable   = 0,
.base.name             = "HSE",
#endif
};

const gclk_generic_gate_t gclk_stm32_lsi_gate = {
_BASIC_SOURCE_GATE_STATIC_INIT(LSI,
                               CLOCK_LSI,
                               GCLK_STM32_RCC_CSR,
                               GCLK_STM32_RCC_CSR,
                               RCC_CSR_LSION_Pos,
                               RCC_CSR_LSIRDY_Pos),
};

/* initializes a basic gate that acts as a simple enable disable switch for a fixed-parent clock */
#define _BDCR_SOURCE_GATE_STATIC_INIT(NAME,FIXFREQ,EN_REG_ID,RDY_REG_ID,EN_BIT,RDY_BIT)\
.base.separated_ops    = _bdcr_gate_ops,\
.base.fixed_input_freq = FIXFREQ,\
.base.flags.is_source  = 1,\
.base.flags.gateable   = 1,\
.base.name             = #NAME,\
.regref                = { .en      = EN_REG_ID,\
                           .rdy     = RDY_REG_ID,\
                           .en_bit  = EN_BIT,\
                           .rdy_bit = RDY_BIT, }

