MichelRottleuthner/RIOT/cpu/stm32/gclk/gclk_stm32l4.c
const gclk_generic_gate_t gclk_stm32_lse_gate = {
_BDCR_SOURCE_GATE_STATIC_INIT(LSE,
                              IS_ACTIVE(CONFIG_BOARD_HAS_LSE) * 32768,
                              GCLK_STM32_RCC_BDCR,
                              GCLK_STM32_RCC_BDCR,
                              RCC_BDCR_LSEON_Pos,
                              RCC_BDCR_LSERDY_Pos),
};

//TODO: with the new way how the base type handles fixed input (parent or freq)
//      it should now be possible to express this directly within the MSI scaler
//      instance!
/* this is a way to express the internal base clock of MSI separately we use the
 * clock base type directly as we do not need any register access information.
   An alternative would be to add a base clock as internal state to the MSI scaler. */
const gclk_t gclk_stm32_msi_base = {
    /* this is as plain a source as it may get. It only provides a fixed frequency
     * and can not even be switched of. THus, there are not any ops set */
    .separated_ops    = NULL,
    .name             = "MSI_BASE",
    .flags.is_source  = 1,
    /* the exact value of the fixed input freq doesn't really matter. It must only be
     * matched to the options of the scalers connected after this instance (i.e. it's children)
     * to properly represent the actual MSI output */
    .fixed_input_freq = 100000,
};

/* initializes a basic gate that acts as a simple enable disable switch for a fixed-parent clock */
#define _BASIC_GATE_STATIC_INIT(NAME,PARENT,EN_REG_ID,RDY_REG_ID,EN_BIT,RDY_BIT)\
.base.separated_ops    = gclk_plain_gate_ops,\
.base.fixed_parent     = PARENT,\
.base.flags.gateable   = 1,\
.base.name             = #NAME,\
.regref                = { .en      = EN_REG_ID,\
                           .rdy     = RDY_REG_ID,\
                           .en_bit  = EN_BIT,\
                           .rdy_bit = RDY_BIT, }

/* gates that are plugged after some configurable clock source wich might be set to an arbitrary frequency */
const gclk_generic_gate_t gclk_stm32_msi_gate = {
_BASIC_GATE_STATIC_INIT(MSI,
                        &gclk_stm32_msi_mux.base,
                        GCLK_STM32_RCC_CR,
                        GCLK_STM32_RCC_CR,
                        RCC_CR_MSION_Pos,
                        RCC_CR_MSIRDY_Pos),
};

/* ready reg and bit of basic gate are simply left unused for this instance */
const gclk_generic_gate_t gclk_stm32_tim5_gate = {
_BASIC_GATE_STATIC_INIT(TIM5,
                        &gclk_apb1_tim_mul_scaler.base,
                        GCLK_STM32_RCC_APB1ENR1,
                        GCLK_NULL_REG,
                        RCC_APB1ENR1_TIM5EN_Pos,
                        0),
};

/* a "dumb" external clock source does not support any operations, the instance is just
   as a placeholder to reuse the same management functions. There is probably a smarter solution

   @todo: map to dummy as this is an input without any config / gate / whatsoever?.
    it is declared here because considereing the currently provided default nodes an input without control maps closest
    to a gate. Maybe a sepatrate generic type for "dumb" sources should be provided as base type too (?) */
const gclk_t gclk_stm32_sai1_ext = {
    /* this is as plain a source as it may get. It only provides a fixed frequency
     * and can not even be switched of. Thus, there are not any ops set */
    .separated_ops    = NULL,
    .name             = "SAI1_EXT",
    .flags.is_source  = 1,
    /* TODO: This value should be overwriteable via (app) configuration
     *       as an alternative a handler that maps to a custom
     *       frequency lookup funtion might also be valueable if this input
     *       frequency is changeable at runtime */
    .fixed_input_freq = 0,
};

const gclk_t gclk_stm32_sai2_ext = {
    /* this is as plain a source as it may get. It only provides a fixed frequency
     * and can not even be switched of. Thus, there are not any ops set */
    .separated_ops    = NULL,
    .name             = "SAI2_EXT",
    .flags.is_source  = 1,
    /* TODO: This value should be overwriteable via (app) configuration
     *       as an alternative a handler that maps to a custom
     *       frequency lookup funtion might also be valueable if this input
     *       frequency is changeable at runtime */
    .fixed_input_freq = 0,
};

//int gclk_stm32_common_mux_set_parent(const gclk_t *clk, unsigned int index)
//{
///* we misuse that as a condition to check if BDCR register is present on this MCU */
//#ifdef RCC_BDCR_LSEON_Pos
//     gclk_mux_ll_t *stm32clkmux = to_gclk_mux_ll_t(clk);
//    /* if this is a clock that is configured trough the backup domain */
//    if (gclk_regref2conf_reg(stm32clkmux->regref) == &RCC->BDCR) {
//        PWR->REG_PWR_CR |= BIT_CR_DBP; /* < disable write protection first */
//    }
//#endif
//
//    gclk_plain_mux_set_parent(clk, index);
//
//#ifdef RCC_BDCR_LSEON_Pos
//    if (gclk_regref2conf_reg(stm32clkmux->regref) == &RCC->BDCR) {
//        PWR->REG_PWR_CR &= ~(BIT_CR_DBP); /* < enable write protection again */
//    }
//#endif
//
//    (void)index;
//    return 0;
//}

//static const gclk_ops_t gclk_stm32_mux_ops = {
//    .enable     = gclk_generic_mux_enable,        /* not needed as pure mux can not be gated */
//    .set_parent = gclk_stm32_common_mux_set_parent,
//    .get_parent = gclk_generic_mux_get_parent,
//    .set_freq   = gclk_generic_mux_set_freq,    /* not needed for a pure mux */
//    .get_freq   = gclk_generic_mux_get_freq,    /* not needed for a pure mux, can just use parents get_freq */
//    .check_freq = gclk_generic_mux_check_freq,
//};


//extern const gclk_t * const gclk_stm32_msi;

/* @todo the data (or config/relation) part of the implementation should be separated from the pure logic
         because for different MCUs the clock tree can vary a lot, parents can be different, or not there at all.
         Also we don't have access to the static parent in a reliable way. I.e. what stm32_clk_gates[1] exactly is, is
         not guranteed
   @todo there is another part of the register that should mybe be preferred to get the current status (SWS)
         should read/write register be separated? */
static const gclk_t * const _sysclk_clk_mux_configs[] = {
    /* values of SW[1:0] RCC_CFGR[1:0] */
    //{ .parent = gclk_stm32_msi,   .config_reg_val = 0b00 }, /* MSI */
    &gclk_stm32_msi_gate.base,   /* MSI  (maps to reg val 0b00) */
    &gclk_stm32_hsi16_gate.base, /* HSI16  (maps to reg val 0b01) */
    &gclk_stm32_hse_gate.base,   /* HSE  (maps to reg val 0b10) */
    &gclk_stm32_pll_r_scaler.base, /* PLLCLK (PLLR) (maps to reg val 0b11) */
};

/* Initializes all fields needed for a clock that encodes its parent options
 * as a list */
#define GCLK_PARENT_LIST_STATIC_INIT(CONFIG_LIST)\
.base.parent_map_op        = gclk_map_parent_list,\
.base.parent_mapping.plist = &CONFIG_LIST[0],\
.base.flags.conf_cnt       = ARRAY_SIZE(CONFIG_LIST)

