MichelRottleuthner/RIOT/cpu/stm32/gclk/gclk_stm32l4.c
const gclk_mux_ll_t gclk_stm32_sysclk_mux = {
GCLK_PLAIN_MUX_STATIC_INIT(SYSCLK,
                           GCLK_STM32_RCC_CFGR,
                           RCC_CFGR_SW_Msk), /* SW[1:0] RCC_CFGR[1:0] */
GCLK_PARENT_LIST_STATIC_INIT(_sysclk_clk_mux_configs),
};

static const gclk_t * const _msi_clk_mux_configs[] = {
    &gclk_stm32_msisrange_scaler.base, /* MSISRANGESEL (startup default) */
    &gclk_stm32_msirange_scaler.base,  /* MSIRANGESEL */
};

/* TODO: this is a special case mux as its setting is only available as startup default.
 *       Therefore reading it works just like any other mux but it is not possible to write it directly.
 *       It would be nice to transport this information to the user/gclk_manager somehow so it is
 *       clear that this setting is read only. */
const gclk_mux_ll_t gclk_stm32_msi_mux = {
GCLK_PLAIN_MUX_STATIC_INIT(MSIMUX,
                           GCLK_STM32_RCC_CR,
                           RCC_CR_MSIRGSEL_Msk), /* MSIRGSEL[0:0] RCC_CR[3:3] */
GCLK_PARENT_LIST_STATIC_INIT(_msi_clk_mux_configs),
};

static const gclk_t * const _clk48_clk_mux_configs[] = {
    /* values of CLK48SEL[1:0] RCC_CCIPR[27:26] */
#if defined(CPU_MODEL_STM32L496ZG) || defined(CPU_MODEL_STM32L496AG)
    &gclk_stm32_hsi48_not_defined,   /* HSI48 (only on STM32L496xx/4A6xx devices) */
#else
    NULL,                            /* NONE i.e. clock to PLLs disabled -> maybe move this to a gate config */
#endif
    &gclk_stm32_pllsai1_q_scaler.base, /* PLLSAI1Q */
    &gclk_stm32_pll_q_scaler.base,     /* PLLQ */
    &gclk_stm32_msi_gate.base,       /* MSI */
};

const gclk_mux_ll_t gclk_stm32_usb_rng_sdmmc_mux = {
GCLK_PLAIN_MUX_STATIC_INIT(CLK48,
                           GCLK_STM32_RCC_CCIPR,
                           RCC_CCIPR_CLK48SEL_Msk), /* CLK48SEL[1:0] RCC_CCIPR[27:26] */
GCLK_PARENT_LIST_STATIC_INIT(_clk48_clk_mux_configs),
};

const gclk_t *_lsco_clk_mux_configs[] = {
    /* values of LSCOSEL[0] RCC_BDCR[25] */
    &gclk_stm32_lsi_gate.base, /* LSI */
    &gclk_stm32_lse_gate.base, /* LSE */
};

/* A driver that implements the mux_ops and gate_ops interface for a gateable mux.
 * It just reuses the basic functions of the generic mux and gate implementations.
 **/
static const gclk_op_t _basic_muxable_gate_ops[] = {
  { .mux_ops  = { .get_parent = gclk_plain_mux_get_parent,
                  .set_parent = gclk_plain_mux_set_parent,}},
  { .gate_ops = { .is_enabled = gclk_generic_gate_ed_rdy_reg_is_enabled,
                  .enable     = gclk_generic_gate_ed_rdy_reg_enable,}},
};

/* This initializes clock instances that are compatible with the generic mux and generic
 * gate interface. I.e., there is a read/write bitfield for control of the parent selection
 * and a single read/write enable bit for clock gating. For now this is not usable for the
 * STM32 clocks that need any special handling before/after access (like with BDCR).
 * @TODO: once the interface gets more mature it could be benefitial to have a standard handling
 *        for such dependencies.
 * */
#define GCLK_STM32_GATEABLE_MUX_STATIC_INIT(NAME,CONF_REG_ID,CONF_REG_MASK,ENABLE_REG_ID,ENABLE_BIT)\
.base.separated_ops  = _basic_muxable_gate_ops,\
.base.flags.muxable  = 1,\
.base.flags.gateable = 1,\
.base.name           = #NAME,\
.regref                  = { .conf     = CONF_REG_ID,\
                             .conf_lsb = STATIC_BITMASK_LSB(CONF_REG_MASK),\
                             .conf_msb = STATIC_BITMASK_MSB(CONF_REG_MASK),\
                             .en       = ENABLE_REG_ID,\
                             .en_bit   = ENABLE_BIT,}

/* TODO: needs custom driver that is muxable and gateable */
const gclk_mux_ll_t gclk_stm32_lsco_mux = {
_GATEABLE_BDCR_MUX_STATIC_INIT(LSCO,
                               GCLK_STM32_RCC_BDCR,
                               RCC_BDCR_LSCOSEL_Msk, /* LSCOSEL[0:0] RCC_BDCR[25:25] */
                               GCLK_STM32_RCC_BDCR,
                               RCC_BDCR_LSCOEN_Pos),
GCLK_PARENT_LIST_STATIC_INIT(_lsco_clk_mux_configs),
};


static const gclk_t * const _rtc_lcd_clk_mux_configs[] = {
    /* values of RTCSEL[1:0] RCC_BDCR[9:8] */
    NULL,                            /* *NONE* i.e. clock to RTC/LCD disabled -> is it better to make this explicit? */
    &gclk_stm32_lse_gate.base,       /* LSE */
    &gclk_stm32_lsi_gate.base,       /* LSI */
    &gclk_stm32_hse_div32_scaler.base, /* HSE /32  TODO: move to separate scaler node and link as parent */
};

const gclk_mux_ll_t gclk_stm32_rtc_lcd_mux = {
_GATEABLE_BDCR_MUX_STATIC_INIT(RTC/LTC,
                               GCLK_STM32_RCC_BDCR,
                               RCC_BDCR_RTCSEL_Msk, /* RTCSEL[1:0] RCC_BDCR[9:8] */
                               GCLK_STM32_RCC_BDCR,
                               RCC_BDCR_RTCEN_Pos),
GCLK_PARENT_LIST_STATIC_INIT(_rtc_lcd_clk_mux_configs),
};

/* this is the clock signal from the mux into the /M predivider, the division itself happens later in a child node */
static const gclk_t * const _pll_pre_div_clk_mux_configs[] = {
    /* values of PLLSRC[1:0] RCC_PLLCFGR[1:0] */
    NULL,                        /* NONE i.e. clock to PLLs disabled -> maybe move this to a gate config */
    &gclk_stm32_msi_gate.base,   /* MSI */
    &gclk_stm32_hsi16_gate.base, /* HSI16 */
    &gclk_stm32_hse_gate.base,   /* HSE */
};

const gclk_mux_ll_t gclk_stm32_pll_pre_div_mux = {
GCLK_PLAIN_MUX_STATIC_INIT(PLL_PREDIV_MUX,
                           GCLK_STM32_RCC_PLLCFGR,
                           RCC_PLLCFGR_PLLSRC_Msk), /* PLLSRC[1:0] RCC_PLLCFGR[1:0] */
GCLK_PARENT_LIST_STATIC_INIT(_pll_pre_div_clk_mux_configs),
    .base.flags.topology_flags = GCLK_STOP_CHILDREN_FOR_UPDATE,
};

static const gclk_t * const _sai1_clk_mux_configs[] = {
    /* values of SAI1SEL[1:0] RCC_CCIPR[23:22] */
    &gclk_stm32_pllsai1_p_scaler.base, /* PLLSAI1P (PLLSAI1CLK)  */
    &gclk_stm32_pllsai2_p_scaler.base, /* PLLSAI2P (PLLSAI2CLK)  */
    &gclk_stm32_pll_p_scaler.base,     /* PLLP     (PLLSAI3CLK)  */
    &gclk_stm32_sai1_ext,              /* External (SAI1_EXTCLK) */
};

/* TODO: needs custom driver that is muxable and gateable */
const gclk_mux_ll_t gclk_stm32_sai1_mux = {
GCLK_STM32_GATEABLE_MUX_STATIC_INIT(SAI1,
                                    GCLK_STM32_RCC_CCIPR,
                                    RCC_CCIPR_SAI1SEL_Msk, /* SAI1SEL[1:0] RCC_CCIPR[23:22] */
                                    GCLK_STM32_RCC_APB2ENR,
                                    RCC_APB2ENR_SAI1EN_Pos),
GCLK_PARENT_LIST_STATIC_INIT(_sai1_clk_mux_configs),
};

static const gclk_t * const _sai2_clk_mux_configs[] = {
    /* values of SAI2SEL[1:0] RCC_CCIPR[25:24] */
    &gclk_stm32_pllsai1_p_scaler.base, /* PLLSAI1P (PLLSAI1CLK)  */
    &gclk_stm32_pllsai2_p_scaler.base, /* PLLSAI2P (PLLSAI2CLK)  */
    &gclk_stm32_pll_p_scaler.base,     /* PLLP     (PLLSAI3CLK)  */
    &gclk_stm32_sai2_ext,              /* External (SAI2_EXTCLK) */
};

/* TODO: needs custom driver that is muxable and gateable */
const gclk_mux_ll_t gclk_stm32_sai2_mux = {
GCLK_STM32_GATEABLE_MUX_STATIC_INIT(SAI2,
                                    GCLK_STM32_RCC_CCIPR,
                                    RCC_CCIPR_SAI2SEL_Msk, /* SAI2SEL[1:0] RCC_CCIPR[25:24] */
                                    GCLK_STM32_RCC_APB2ENR,
                                    RCC_APB2ENR_SAI2EN_Pos),
GCLK_PARENT_LIST_STATIC_INIT(_sai2_clk_mux_configs),
};

