MichelRottleuthner/RIOT/cpu/stm32/gclk/gclk_stm32l4.c
static const gclk_t * const _mco_clk_mux_configs[] = {
    /* values of MCOSEL[3:0] RCC_CFGR[27:24] (on STM32L496xx/4A6xx devices) or
                 MCOSEL[2:0] RCC_CFGR[26:24] (on STM32L475xx/476xx/486xx devices) */
    NULL,                         /* *NONE* TODO: implement as separate gate */
    &gclk_stm32_sysclk_mux.base,    /* SYSCLK */
    &gclk_stm32_msi_gate.base,    /* MSI */
    &gclk_stm32_hsi16_gate.base,  /* HSI16 */
    &gclk_stm32_hse_gate.base,    /* HSE */
    &gclk_stm32_pll_r_scaler.base,  /* MAIN PLL (PLLR) */
    &gclk_stm32_lsi_gate.base,    /* LSI */
    &gclk_stm32_lse_gate.base,    /* LSE */
#if defined(CPU_MODEL_STM32L496ZG) || defined(CPU_MODEL_STM32L496AG)
    gclk_stm32_hsi48_not_defined, /* HSI48 (only on STM32L496xx/4A6xx devices) */
#endif
};

const gclk_mux_ll_t gclk_stm32_mco_mux = {
GCLK_PLAIN_MUX_STATIC_INIT(MCOMUX,
                           GCLK_STM32_RCC_CFGR,
                           RCC_CFGR_MCOSEL_Msk), /* MCOSEL[2:0] RCC_CFGR[26:24] */
GCLK_PARENT_LIST_STATIC_INIT(_mco_clk_mux_configs),
};

static const gclk_t * const _adc_clk_mux_configs[] = {
    /* values of ADCSEL[1:0] RCC_CCIPR[29:28] */
    NULL,                            /* NONE i.e. clock to ADC disabled -> maybe move this to a gate config */
    &gclk_stm32_pllsai1_r_scaler.base, /* PLLSAI1R */
    &gclk_stm32_pllsai2_r_scaler.base, /* PLLSAI2R */
    &gclk_stm32_sysclk_mux.base,       /* SYSCLK */
};

const gclk_mux_ll_t gclk_stm32_adc_mux = {
GCLK_STM32_GATEABLE_MUX_STATIC_INIT(ADC,
                                    GCLK_STM32_RCC_CCIPR,
                                    RCC_CCIPR_ADCSEL_Msk, /* ADCSEL[1:0] RCC_CCIPR[29:28] */
                                    GCLK_STM32_RCC_AHB2ENR,
                                    RCC_AHB2ENR_ADCEN_Pos),
GCLK_PARENT_LIST_STATIC_INIT(_adc_clk_mux_configs),
};

static const gclk_t * const _i2c_1_2_3_clk_mux_configs[] = {
    /* values of I2C3SEL[1:0] RCC_CCIPR[17:16] and
                 I2C2SEL[1:0] RCC_CCIPR[15:14] and
                 I2C1SEL[1:0] RCC_CCIPR[13:12] respectively */
    &gclk_stm32_apb1_scaler.base,  /* APB1 (PCLK1)   */
    &gclk_stm32_sysclk_mux.base,   /* SYSCLK */
    &gclk_stm32_hsi16_gate.base, /* HSI16  */
  //{ .parent = ??,   .config_reg_val = 0b11 }, /* Reserved  (remove?)  */
};

const gclk_mux_ll_t gclk_stm32_i2c1_mux = {
GCLK_STM32_GATEABLE_MUX_STATIC_INIT(I2C1,
                                    GCLK_STM32_RCC_CCIPR,
                                    RCC_CCIPR_I2C1SEL_Msk, /*  I2C1SEL[1:0] RCC_CCIPR[13:12] */
                                    GCLK_STM32_RCC_APB1ENR1,
                                    RCC_APB1ENR1_I2C1EN_Pos),
GCLK_PARENT_LIST_STATIC_INIT(_i2c_1_2_3_clk_mux_configs),
};

const gclk_mux_ll_t gclk_stm32_i2c2_mux = {
GCLK_STM32_GATEABLE_MUX_STATIC_INIT(I2C2,
                                    GCLK_STM32_RCC_CCIPR,
                                    RCC_CCIPR_I2C2SEL_Msk, /* I2C2SEL[1:0] RCC_CCIPR[15:14] */
                                    GCLK_STM32_RCC_APB1ENR1,
                                    RCC_APB1ENR1_I2C2EN_Pos),
GCLK_PARENT_LIST_STATIC_INIT(_i2c_1_2_3_clk_mux_configs),
};

const gclk_mux_ll_t gclk_stm32_i2c3_mux = {
GCLK_STM32_GATEABLE_MUX_STATIC_INIT(I2C3,
                                    GCLK_STM32_RCC_CCIPR,
                                    RCC_CCIPR_I2C3SEL_Msk, /* I2C3SEL[1:0] RCC_CCIPR[17:16] */
                                    GCLK_STM32_RCC_APB1ENR1,
                                    RCC_APB1ENR1_I2C3EN_Pos),
GCLK_PARENT_LIST_STATIC_INIT(_i2c_1_2_3_clk_mux_configs),
};

static const gclk_t * const _dfsdm1_clk_mux_configs[] = {
    /* values of DFSDM1SEL[0] RCC_CCIPR[31] */
    &gclk_stm32_apb2_scaler.base, /* APB2 (PCLK2) */
    &gclk_stm32_sysclk_mux.base,  /* SYSCLK */
};

const gclk_mux_ll_t gclk_stm32_dfsdm1_mux = {
GCLK_STM32_GATEABLE_MUX_STATIC_INIT(DFSDM1,
                                    GCLK_STM32_RCC_CCIPR,
                                    RCC_CCIPR_DFSDM1SEL_Msk, /* DFSDM1SEL[0:0] RCC_CCIPR[31:31] */
                                    GCLK_STM32_RCC_APB2ENR,
                                    RCC_APB2ENR_DFSDM1EN_Pos),
GCLK_PARENT_LIST_STATIC_INIT(_dfsdm1_clk_mux_configs),
};

/* valid for all uarts apart from usart1, which uses PCLK2 instead of PCLK1
   The values are actually the same so maybe there is an efficient way to merge it */
static const gclk_t * const _uart_lp1_5_4_3_2_clk_mux_configs[] = {
    /* values of LPUART1SEL[1:0] RCC_CCIPR[11:10] and
                 UART5SEL[1:0] RCC_CCIPR[9:8] and
                 UART4SEL[1:0] RCC_CCIPR[7:6] and
                 USART3SEL[1:0] RCC_CCIPR[5:4] and
                 USART2SEL[1:0] RCC_CCIPR[3:2] respectively */
    &gclk_stm32_apb1_scaler.base,  /* APB1 (PCLK1)   */
    &gclk_stm32_sysclk_mux.base,   /* SYSCLK */
    &gclk_stm32_hsi16_gate.base, /* HSI16  */
    &gclk_stm32_lse_gate.base,   /* LSE */
};

const gclk_mux_ll_t gclk_stm32_lpuart1_mux = {
GCLK_STM32_GATEABLE_MUX_STATIC_INIT(LPUART1,
                                    GCLK_STM32_RCC_CCIPR,
                                    RCC_CCIPR_LPUART1SEL_Msk, /* LPUART1SEL[1:0] RCC_CCIPR[11:10] */
                                    GCLK_STM32_RCC_APB1ENR2,
                                    RCC_APB1ENR2_LPUART1EN_Pos),
GCLK_PARENT_LIST_STATIC_INIT(_uart_lp1_5_4_3_2_clk_mux_configs),
};

const gclk_mux_ll_t gclk_stm32_uart5_mux = {
GCLK_STM32_GATEABLE_MUX_STATIC_INIT(UART5,
                                    GCLK_STM32_RCC_CCIPR,
                                    RCC_CCIPR_UART5SEL_Msk, /* UART5SEL[1:0] RCC_CCIPR[9:8] */
                                    GCLK_STM32_RCC_APB1ENR1,
                                    RCC_APB1ENR1_UART5EN_Pos),
GCLK_PARENT_LIST_STATIC_INIT(_uart_lp1_5_4_3_2_clk_mux_configs),
};

const gclk_mux_ll_t gclk_stm32_uart4_mux = {
GCLK_STM32_GATEABLE_MUX_STATIC_INIT(UART4,
                                    GCLK_STM32_RCC_CCIPR,
                                    RCC_CCIPR_UART4SEL_Msk, /* UART4SEL[1:0] RCC_CCIPR[7:6] */
                                    GCLK_STM32_RCC_APB1ENR1,
                                    RCC_APB1ENR1_UART4EN_Pos),
GCLK_PARENT_LIST_STATIC_INIT(_uart_lp1_5_4_3_2_clk_mux_configs),
};

const gclk_mux_ll_t gclk_stm32_usart3_mux = {
GCLK_STM32_GATEABLE_MUX_STATIC_INIT(USART3,
                                    GCLK_STM32_RCC_CCIPR,
                                    RCC_CCIPR_USART3SEL_Msk, /* USART3SEL[1:0] RCC_CCIPR[5:4] */
                                    GCLK_STM32_RCC_APB1ENR1,
                                    RCC_APB1ENR1_USART3EN_Pos),
GCLK_PARENT_LIST_STATIC_INIT(_uart_lp1_5_4_3_2_clk_mux_configs),
};

const gclk_mux_ll_t gclk_stm32_usart2_mux = {
GCLK_STM32_GATEABLE_MUX_STATIC_INIT(USART2,
                                    GCLK_STM32_RCC_CCIPR,
                                    RCC_CCIPR_USART2SEL_Msk, /* USART2SEL[1:0] RCC_CCIPR[3:2] */
                                    GCLK_STM32_RCC_APB1ENR1,
                                    RCC_APB1ENR1_USART2EN_Pos),
GCLK_PARENT_LIST_STATIC_INIT(_uart_lp1_5_4_3_2_clk_mux_configs),
};


static const gclk_t * const _usart_1_clk_mux_configs[] = {
    /* values of USART1SEL[1:0] RCC_CCIPR[1:0] */
    &gclk_stm32_apb2_scaler.base,  /* APB2 (PCLK2)   */
    &gclk_stm32_sysclk_mux.base,   /* SYSCLK */
    &gclk_stm32_hsi16_gate.base, /* HSI16  */
    &gclk_stm32_lse_gate.base,   /* LSE */
};

