MichelRottleuthner/RIOT/cpu/stm32/gclk/gclk_stm32l4.c
const gclk_mux_ll_t gclk_stm32_usart1_mux = {
GCLK_STM32_GATEABLE_MUX_STATIC_INIT(USART1,
                                    GCLK_STM32_RCC_CCIPR,
                                    RCC_CCIPR_USART1SEL_Msk, /* USART1SEL[1:0] RCC_CCIPR[1:0] */
                                    GCLK_STM32_RCC_APB2ENR,
                                    RCC_APB2ENR_USART1EN_Pos),
GCLK_PARENT_LIST_STATIC_INIT(_usart_1_clk_mux_configs),
};

static const gclk_t * const _swpmi1_clk_mux_configs[] = {
    /* values of SWPMI1SEL[0] RCC_CCIPR[30] */
    &gclk_stm32_apb1_scaler.base,  /* APB1 (PCLK1) */
    &gclk_stm32_hsi16_gate.base, /* HSI16 */
};

const gclk_mux_ll_t gclk_stm32_swpmi1_mux = {
GCLK_STM32_GATEABLE_MUX_STATIC_INIT(SWPMI1,
                                    GCLK_STM32_RCC_CCIPR,
                                    RCC_CCIPR_SWPMI1SEL_Msk, /* SWPMI1SEL[0:0] RCC_CCIPR[30:30] */
                                    GCLK_STM32_RCC_APB1ENR2,
                                    RCC_APB1ENR2_SWPMI1EN_Pos),
GCLK_PARENT_LIST_STATIC_INIT(_swpmi1_clk_mux_configs),
};

static const gclk_t * const  _lptim_1_2_clk_mux_configs[] = {
    /* values of LPTIM2SEL[1:0] RCC_CCIPR[21:20] and
                 LPTIM1SEL[1:0] RCC_CCIPR[19:18] respectively*/
    &gclk_stm32_apb1_scaler.base,  /* APB1 (PCLK1)  */
    &gclk_stm32_lsi_gate.base,   /* LSI   */
    &gclk_stm32_hsi16_gate.base, /* HSI16 */
    &gclk_stm32_lse_gate.base,   /* LSE   */
};

const gclk_mux_ll_t gclk_stm32_lptim1_mux = {
GCLK_STM32_GATEABLE_MUX_STATIC_INIT(LPTIM1,
                                    GCLK_STM32_RCC_CCIPR,
                                    RCC_CCIPR_LPTIM1SEL_Msk, /* LPTIM1SEL[1:0] RCC_CCIPR[19:18] */
                                    GCLK_STM32_RCC_APB1ENR1,
                                    RCC_APB1ENR1_LPTIM1EN_Pos),
GCLK_PARENT_LIST_STATIC_INIT(_lptim_1_2_clk_mux_configs),
};

const gclk_mux_ll_t gclk_stm32_lptim2_mux = {
GCLK_STM32_GATEABLE_MUX_STATIC_INIT(LPTIM2,
                                    GCLK_STM32_RCC_CCIPR,
                                    RCC_CCIPR_LPTIM2SEL_Msk, /* LPTIM2SEL[1:0] RCC_CCIPR[21:20] */
                                    GCLK_STM32_RCC_APB1ENR2,
                                    RCC_APB1ENR2_LPTIM2EN_Pos),
GCLK_PARENT_LIST_STATIC_INIT(_lptim_1_2_clk_mux_configs),
};
/* @todo implement custom scaler for APB1/2 conditional x1 x2 multiplier that is fed to timers */
//TODO: all the parents link in private data structures probably have to go to the generic upper layer

//TODO currently not considered
//static const gclk_range32_t _vco_freq_in_constraint = {
//    .min =  4000000,  .max =  16000000,
//};

//TODO currently not considered
//static const gclk_range32_t _vco_freq_out_constraint = {
//    .min = 64000000,  .max = 344000000,
//};

//TODO currently not considered
//static const gclk_range32_t _pll_pqr_freq_out_constraint = {
//    .min = 0,         .max = 80000000,
//};

/* The value from the register directly maps to the respective numeric value for calculation */
static const gclk_range8_t _pll_n_factor_range = {
    .min =  8, .max =  86,
};

/* @todo here we face a problem: the output frequency of the conditional "post APBx"/"pre TIMx" multiplier node requires
         internal state of the APB2 prescaler. Just knowing the frequency of the parent (APBx) is not enough, because
         the condition does not depend on the frequency itself but the internal prescaler value.
         Possible solutions:
         (A) give access to the internals of the parent
         (not only the current state but also the hypothetical i.e. "asked for" state).
         (B) handover the whole topology config that we want to query.
            - That way we can deduce the prescaler value from the parent freq and the parent's parent-freq
              (a.k.a. APBx freq and AHB freq in this case)
         (C) drop support for preliminary clock config evaluation (always require to change all setting up to a child
             before it can be queried for options)
         (D) make explicit exceptions for children that can not be pre-evaluated and signal the "undecidable" state somehow
             -> i.e. - indicate the frequency conditionally depends on the parent topology
                     - indicate options: for a given freq the output may be x or y or whatever */
unsigned long gclk_stm32_common_post_apb_mul_scaler_check_freq(const gclk_t *ll,
                                                                      clk_topology_entry_t *input_topology,
                                                                      uint32_t topology_len, uint32_t hz,
                                                                      uint32_t flags)
{
    assert(topology_len >= 2);
    (void)ll;
    (void)hz;
    (void)flags;

    /* in this particular case we know there is only one possibile topology for the next two parents:
       PCLKx is driven by APBx, APBx is driven by AHB */
    uint32_t apbx_hz = input_topology[0].clk_freq;
    uint32_t ahb_hz =  input_topology[1].clk_freq;

    uint32_t pre_tim_mul = 2;

    /* if APBx and AHB frequencies are equal, APBx prescaler must be 1, forcing the pre-timer multiplier to 1 */
    if (apbx_hz == ahb_hz) {
        pre_tim_mul = 1;
    }

    return apbx_hz * pre_tim_mul;
}

unsigned int gclk_stm32_uptree_dependent_scaler_get_factor(const gclk_t *clk) {
    return clk->cross_ref_factor_map_op(clk, NULL);
}

/* Implementation of only the scale_ops interface for a read only scaler where
 * its scaling value strictly depends on another clock (read-only).
 **/
static const gclk_op_t _stm32_conditional_read_only_scaler_ops[] = {
  { .scale_ops = { .get_factor = gclk_stm32_uptree_dependent_scaler_get_factor,
                   .set_factor = NULL,}},
};

/* _pll_p_div_confs, _pll_qr_div_confs, _msi_range_confs, _stm32_m_div_mul_confs, _stm32_mco_div_confs
   all encode the register value as index */
static const uint8_t _pll_p_div_confs[] = { 7, 17 };
static const uint8_t _pll_qr_div_confs[] = { 2, 4, 6, 8 };
/* The factors assume an MSI-internal base clock of 100000Hz */
static const uint16_t _msi_range_confs[] = { 1, 2, 4, 8, 10, 20, 40, 80, 160, 240, 320, 480 };
static const uint8_t _stm32_m_div_mul_confs[] = { 1, 2, 3, 4, 5, 6, 7 ,8 };
/* an equivalent encoding for the below list would be the following LUT:
 * { .factor = 1,  .reg_val = 0b000 },
 * { .factor = 2,  .reg_val = 0b001 },
 * { .factor = 4,  .reg_val = 0b010 },
 * { .factor = 8,  .reg_val = 0b011 },
 * { .factor = 16, .reg_val = 0b100 }, */
static const uint8_t _stm32_mco_div_confs[] = { 1, 2, 4, 8, 16, };


static const gclk_reg_val_factor_lut_t _msis_range_confs[] = {
    // The factor assumes an MSI-internal base clock of 100000Hz */
    { .factor = 10,  .reg_val = 0b0100 },
    { .factor = 20,  .reg_val = 0b0101 },
    { .factor = 40,  .reg_val = 0b0110 },
    { .factor = 80,  .reg_val = 0b0111 },
};

// Note: setting this correctly needs to consider voltage in the future (DVFS)
static const gclk_reg_val_factor_lut_t _stm32_ahb_div_confs[] = {
    /* actually any 0b0xxx maps to 1 too -> do we need to include that?
       @todo: if the HW doesn't set any of those dont-care values to indicate a factor of 1, we can leave it as is
              because the implementation will always use the only 0b0000 value (check with reset/default values) */
    { .factor = 1,   .reg_val = 0b0000 },
    { .factor = 2,   .reg_val = 0b1000 },
    { .factor = 4,   .reg_val = 0b1001 },
    { .factor = 8,   .reg_val = 0b1010 },
    { .factor = 16,  .reg_val = 0b1011 },
    { .factor = 64,  .reg_val = 0b1100 },
    { .factor = 128, .reg_val = 0b1100 },
    { .factor = 256, .reg_val = 0b1100 },
    { .factor = 512, .reg_val = 0b1100 },
};

static const gclk_reg_val_factor_lut_t _stm32_apb_div_confs[] = {
    { .factor = 1,   .reg_val = 0b000 },
    { .factor = 2,   .reg_val = 0b100 },
    { .factor = 4,   .reg_val = 0b101 },
    { .factor = 8,   .reg_val = 0b110 },
    { .factor = 16,  .reg_val = 0b111 },
};

/* Reuses the plain scaler driver that only implements the scale_ops interface
 * for a scaler that is interfaced via a bitfield in a read/write register that
 * exposes the current selection and also allows changing it. */
#define GCLK_PLAIN_SCALER_STATIC_INIT(NAME,PARENT,CONF_REG_ID,CONF_REG_MASK)\
.base.separated_ops      = gclk_plain_scaler_ops,\
.base.flags.scalable     = 1,\
.base.fixed_parent       = PARENT,\
.regref                  = { .conf     = CONF_REG_ID,\
                             .conf_lsb = STATIC_BITMASK_LSB(CONF_REG_MASK),\
                             .conf_msb = STATIC_BITMASK_MSB(CONF_REG_MASK) },\
.base.name               = #NAME

