MichelRottleuthner/RIOT/cpu/stm32/gclk/gclk_stm32l4.c
#define GCLK_PLAIN_DIV_SCALER_STATIC_INIT(NAME,PARENT,CONF_REG_ID,CONF_REG_MASK)\
GCLK_PLAIN_SCALER_STATIC_INIT(NAME,PARENT,CONF_REG_ID,CONF_REG_MASK),\
.base.flags.scaler_type  = GCLK_DIV

#define GCLK_PLAIN_MUL_SCALER_STATIC_INIT(NAME,PARENT,CONF_REG_ID,CONF_REG_MASK)\
GCLK_PLAIN_SCALER_STATIC_INIT(NAME,PARENT,CONF_REG_ID,CONF_REG_MASK),\
.base.flags.scaler_type  = GCLK_MUL

//TODO this is probably reusable elsewhere -> move to somewhere for othjers to reuse
/* A driver for a gateable scaler that just reuses the basic imlementations
 * of the scaler and gate */
const gclk_op_t gclk_gateable_scaler_ops[] = {
   { .scale_ops = { .get_factor = gclk_generic_scaler_get_factor,
                    .set_factor = gclk_generic_scaler_set_factor,}},
   { .gate_ops  = { .is_enabled = gclk_generic_gate_ed_rdy_reg_is_enabled,
                    .enable     = gclk_generic_gate_ed_rdy_reg_enable,}},
};

#define GCLK_CONDITONAL_MUL_SCALER_STATIC_INIT(NAME,PARENT,CONF_REG_ID,CONF_REG_MASK)\
.base.separated_ops  = _stm32_conditional_read_only_scaler_ops,\
.base.flags.scalable = 1,\
.base.flags.scaler_type  = GCLK_MUL,\
.base.fixed_parent   = PARENT,\
.regref              = { .conf     = CONF_REG_ID,\
                         .conf_lsb = STATIC_BITMASK_LSB(CONF_REG_MASK),\
                         .conf_msb = STATIC_BITMASK_MSB(CONF_REG_MASK) },\
.base.name           = #NAME

#define GCLK_GATEABLE_SCALER_STATIC_INIT(NAME,PARENT,EN_REG_ID,EN_BIT,CONF_REG_ID,CONF_REG_MASK)\
.base.separated_ops  = gclk_gateable_scaler_ops,\
.base.flags.gateable = 1,\
.base.flags.scalable = 1,\
.base.fixed_parent   = PARENT,\
.regref              = { .en       = EN_REG_ID,\
                         .conf     = CONF_REG_ID,\
                         .en_bit   = EN_BIT,\
                         .conf_lsb = STATIC_BITMASK_LSB(CONF_REG_MASK),\
                         .conf_msb = STATIC_BITMASK_MSB(CONF_REG_MASK) },\
.base.name           = #NAME

#define GCLK_GATEABLE_DIV_SCALER_STATIC_INIT(NAME,PARENT,EN_REG_ID,EN_BIT,CONF_REG_ID,CONF_REG_MASK)\
GCLK_GATEABLE_SCALER_STATIC_INIT(NAME,PARENT,EN_REG_ID,EN_BIT,CONF_REG_ID,CONF_REG_MASK),\
.base.flags.scaler_type  = GCLK_DIV

/* initializes a gateable mul scaler that makes use of the ready reg/bit */
#define GCLK_GATEABLE_MUL_SCALER_STATIC_INIT(NAME,PARENT,EN_REG_ID,EN_BIT,RDY_REG_ID,RDY_BIT,CONF_REG_ID,CONF_REG_MASK)\
GCLK_GATEABLE_SCALER_STATIC_INIT(NAME,PARENT,EN_REG_ID,EN_BIT,CONF_REG_ID,CONF_REG_MASK),\
.regref.rdy = RDY_REG_ID,\
.regref.rdy_bit = RDY_BIT,\
.base.flags.scaler_type  = GCLK_MUL

/* @todo: introduce the concept of a base-scaler?
          I: a base scaler is defined for an instance: reuse all infos from the base scaler instead of own data
          II: no base scaler is definded: every scaler needs to provide it's own information */
//gclk_clk_scaler_ll_t stm32_clk_scalers[]
const gclk_clk_scaler_ll_t gclk_stm32_ahb_scaler = {
GCLK_PLAIN_DIV_SCALER_STATIC_INIT(AHB,
                                  &gclk_stm32_sysclk_mux.base,
                                  GCLK_STM32_RCC_CFGR,
                                  RCC_CFGR_HPRE_Msk), /* HPRE[3:0] (CFGR[7:4]) */
GCLK_FACTOR_LUT_STATIC_INIT(_stm32_ahb_div_confs),
};

const gclk_clk_scaler_ll_t gclk_stm32_apb1_scaler = {
GCLK_PLAIN_DIV_SCALER_STATIC_INIT(APB1,
                                  &gclk_stm32_ahb_scaler.base,
                                  GCLK_STM32_RCC_CFGR,
                                  RCC_CFGR_PPRE1_Msk), /* PPRE1[2:0] (CFGR[10:8]) */
GCLK_FACTOR_LUT_STATIC_INIT(_stm32_apb_div_confs),
};

const gclk_clk_scaler_ll_t gclk_stm32_apb2_scaler = {
GCLK_PLAIN_DIV_SCALER_STATIC_INIT(APB2,
                                  &gclk_stm32_ahb_scaler.base,
                                  GCLK_STM32_RCC_CFGR,
                                  RCC_CFGR_PPRE2_Msk), /* PPRE2[2:0] (CFGR[13:11]) */
GCLK_FACTOR_LUT_STATIC_INIT(_stm32_apb_div_confs),
};

const gclk_clk_scaler_ll_t gclk_stm32_pll_m_scaler = {
GCLK_PLAIN_DIV_SCALER_STATIC_INIT(PLL_M,
                                  &gclk_stm32_pll_pre_div_mux.base,
                                  GCLK_STM32_RCC_PLLCFGR,
                                  RCC_PLLCFGR_PLLM_Msk), /* PLLM[2:0] (PLLCFGR[6:4]) */
GCLK_LIST8_STATIC_INIT(_stm32_m_div_mul_confs),
    .base.flags.topology_flags = GCLK_STOP_CHILDREN_FOR_UPDATE,
//    .out_freq_constraint       = &_vco_freq_in_constraint,
};

const gclk_clk_scaler_ll_t gclk_stm32_msirange_scaler = {
    // TODO use the existing member for internal fixed source freq
    // TODO also the startup frequency is specified via a separate register: RCC_CSR MSISRANGE -> how to model that?
    //      For now: separate msisrange_scaler (below) and then a virtual mux after both
GCLK_PLAIN_MUL_SCALER_STATIC_INIT(MSIRANGE,
                                  &gclk_stm32_msi_base,
                                  GCLK_STM32_RCC_CR,
                                  RCC_CR_MSIRANGE_Msk), /* MSIRANGE[3:0] (RCC_CR[7:4]) */
GCLK_LIST16_STATIC_INIT(_msi_range_confs),
};

const gclk_clk_scaler_ll_t gclk_stm32_msisrange_scaler = {
    //TODO: same as above: use internal fixed freq instead of fixed parent
GCLK_PLAIN_MUL_SCALER_STATIC_INIT(MSISRANGE,
                                  &gclk_stm32_msi_base,
                                  GCLK_STM32_RCC_CSR,
                                  RCC_CSR_MSISRANGE_Msk), /* MSISRANGE[3:1] (RCC_CSR[10:8]) */
/* This STARTUP flag is not used at the moment
 * -> default topology/scaling settings dont employ those settings.
 *  We still include it for now anyway to be able to decode this information from the registers.
 * If this shows to be a feature which is also more commonly available on other platforms, a
 * possible way to work with such settings could be to have an optional startup/default-config interface
 * extension for nodes (similar to the scaler/mux/gate options already available).
 */
 // .base.flags.topology_flags = GCLK_ONLY_FOR_STARTUP,
GCLK_FACTOR_LUT_STATIC_INIT(_msis_range_confs)
};

const gclk_clk_scaler_ll_t gclk_stm32_mco_div_scaler = {
GCLK_PLAIN_DIV_SCALER_STATIC_INIT(MCO,
                                  &gclk_stm32_mco_mux.base,
                                  GCLK_STM32_RCC_CFGR,
                                  RCC_CFGR_MCOPRE_Msk), /* MCOPRE[2:0] (RCC_CFGR[30:28]) */
GCLK_LIST8_STATIC_INIT(_stm32_mco_div_confs),
};

