MichelRottleuthner/RIOT/cpu/stm32/gclk/gclk_stm32l4.c
#if defined(CPU_MODEL_STM32L496ZG) || defined(CPU_MODEL_STM32L496AG)
/* the P divider is only available with full range on STM32L496xx/4A6xx
   on other platforms there is only a divtable with two values (either 7 or 17) available*/
static const struct gclk_range8_t _pll_p_factor_range {
    //TODO: 1 is reserved, and 0 maps the factor function to PLLP bit (to a value of 7 or 17)
    //factor value mapped directly to reg value
    .min =  2,
    .max =  31,
};

//TODO: this is a gateable scaler
/* @todo on STM32L496xx/4A6xx devices the alternative setting of P (to 7 or 17) via the single PLLP bit is available too
         -> should be safe to ignore because they are covered by the range employed below
            i.e. the same values can also be set without the bit (everywhere?) */
const gclk_clk_scaler_ll_t gclk_stm32_pll_p_scaler = {
GCLK_GATEABLE_DIV_SCALER_STATIC_INIT(PLL_P,
                                     &gclk_stm32_pll_vco_scaler.base,
                                     GCLK_STM32_RCC_PLLCFGR,
                                     RCC_PLLCFGR_PLLPEN_Pos, /* PLLCFGR[16] (PLLPEN) */
                                     GCLK_STM32_RCC_PLLCFGR,
                                     RCC_PLLCFGR_PLLPDIV_Msk), /* PLLPDIV[4:0] (PLLCFGR[31:27]) */
 GCLK_RANGE8_STATIC_INIT(_pll_p_factor_range),
    .base.flags.topology_flags = GCLK_STOP_PARENT_FOR_UPDATE,
    //.out_freq_constraint       = &_pll_pqr_freq_out_constraint,
};

const gclk_clk_scaler_ll_t gclk_stm32_pllsai1_p_scaler = {
GCLK_GATEABLE_DIV_SCALER_STATIC_INIT(PLLSAI1_P,
                                     &gclk_stm32_pllsai1_vco_scaler.base,
                                     GCLK_STM32_RCC_PLLSAI1CFGR,
                                     RCC_PLLSAI1CFGR_PLLSAI1PEN_Pos, /* PLLSAI1CFGR[16] (PLLSAI1PEN) */
                                     GCLK_STM32_RCC_PLLSAI1CFGR,
                                     RCC_PLLSAI1CFGR_PLLSAI1PDIV_Msk), /* PLLSAI1PDIV[4:0] (PLLSAI1CFGR[31:27]) */
 GCLK_RANGE8_STATIC_INIT(_pll_p_factor_range),
    //.out_freq_constraint       = &_pll_pqr_freq_out_constraint,
};

const gclk_clk_scaler_ll_t gclk_stm32_pllsai2_p_scaler = {
GCLK_GATEABLE_DIV_SCALER_STATIC_INIT(PLLSAI2_P,
                                     &gclk_stm32_pllsai2_vco_scaler.base,
                                     GCLK_STM32_RCC_PLLSAI2CFGR,
                                     RCC_PLLSAI2CFGR_PLLSAI2PEN_Pos, /* PLLSAI2CFGR[16] (PLLSAI2PEN) */
                                     GCLK_STM32_RCC_PLLSAI2CFGR,
                                     RCC_PLLSAI2CFGR_PLLSAI2PDIV_Msk), /* PLLSAI2PDIV[4:0] (PLLSAI2CFGR[31:27]) */
 GCLK_RANGE8_STATIC_INIT(_pll_p_factor_range),
    //.out_freq_constraint       = &_pll_pqr_freq_out_constraint,
};
#else /* everything that is not CPU_MODEL_STM32L496ZG || CPU_MODEL_STM32L496AG */

const gclk_clk_scaler_ll_t gclk_stm32_pll_p_scaler = {
GCLK_GATEABLE_DIV_SCALER_STATIC_INIT(PLL_P,
                                     &gclk_stm32_pll_vco_scaler.base,
                                     GCLK_STM32_RCC_PLLCFGR,
                                     RCC_PLLCFGR_PLLPEN_Pos, /* PLLCFGR[16] (PLLPEN) */
                                     GCLK_STM32_RCC_PLLCFGR,
                                     RCC_PLLCFGR_PLLP_Msk), /* PLLP[1:0] (PLLCFGR[22:21]) */
GCLK_LIST8_STATIC_INIT(_pll_p_div_confs),
    .base.flags.topology_flags = GCLK_STOP_PARENT_FOR_UPDATE,
    //.out_freq_constraint       = &_pll_pqr_freq_out_constraint,
};

const gclk_clk_scaler_ll_t gclk_stm32_pllsai1_p_scaler = {
GCLK_GATEABLE_DIV_SCALER_STATIC_INIT(PLLSAI1_P,
                                     &gclk_stm32_pllsai1_vco_scaler.base,
                                     GCLK_STM32_RCC_PLLSAI1CFGR,
                                     RCC_PLLSAI1CFGR_PLLSAI1PEN_Pos, /* PLLSAI1CFGR[16] (PLLSAI1PEN) */
                                     GCLK_STM32_RCC_PLLSAI1CFGR,
                                     RCC_PLLSAI1CFGR_PLLSAI1P_Msk), /* PLLSAI1P[0:0] (PLLSAI1CFGR[17:17]) */
GCLK_LIST8_STATIC_INIT(_pll_p_div_confs),
    .base.flags.topology_flags =  GCLK_STOP_PARENT_FOR_UPDATE,
    //.out_freq_constraint       = &_pll_pqr_freq_out_constraint,
};

const gclk_clk_scaler_ll_t gclk_stm32_pllsai2_p_scaler = {
GCLK_GATEABLE_DIV_SCALER_STATIC_INIT(PLLSAI2_P,
                                     &gclk_stm32_pllsai2_vco_scaler.base,
                                     GCLK_STM32_RCC_PLLSAI2CFGR,
                                     RCC_PLLSAI2CFGR_PLLSAI2PEN_Pos, /* PLLSAI2CFGR[16] (PLLSAI2PEN) */
                                     GCLK_STM32_RCC_PLLSAI2CFGR,
                                     RCC_PLLSAI2CFGR_PLLSAI2P_Msk), /* PLLSAI2P[0:0] (PLLSAI2CFGR[17:17]) */
GCLK_LIST8_STATIC_INIT(_pll_p_div_confs),
    .base.flags.topology_flags =  GCLK_STOP_PARENT_FOR_UPDATE,
    //.out_freq_constraint       = &_pll_pqr_freq_out_constraint,
};
#endif


const gclk_clk_scaler_ll_t gclk_stm32_pll_q_scaler = {
GCLK_GATEABLE_DIV_SCALER_STATIC_INIT(PLL_Q,
                                     &gclk_stm32_pll_vco_scaler.base,
                                     GCLK_STM32_RCC_PLLCFGR,
                                     RCC_PLLCFGR_PLLQEN_Pos, /* PLLCFGR[20] (PLLQEN) */
                                     GCLK_STM32_RCC_PLLCFGR,
                                     RCC_PLLCFGR_PLLQ_Msk), /* PLLQ[1:0] (PLLCFGR[22:21]) */
GCLK_LIST8_STATIC_INIT(_pll_qr_div_confs),
    .base.flags.topology_flags = GCLK_STOP_PARENT_FOR_UPDATE,
    //.out_freq_constraint       = &_pll_pqr_freq_out_constraint,
};

const gclk_clk_scaler_ll_t gclk_stm32_pll_r_scaler = {
GCLK_GATEABLE_DIV_SCALER_STATIC_INIT(PLL_R,
                                     &gclk_stm32_pll_vco_scaler.base,
                                     GCLK_STM32_RCC_PLLCFGR,
                                     RCC_PLLCFGR_PLLREN_Pos, /* PLLCFGR[24] (PLLREN) */
                                     GCLK_STM32_RCC_PLLCFGR,
                                     RCC_PLLCFGR_PLLR_Msk), /* PLLR[1:0] (PLLCFGR[26:25]) */
GCLK_LIST8_STATIC_INIT(_pll_qr_div_confs),
    .base.flags.topology_flags = GCLK_STOP_PARENT_FOR_UPDATE,
    //.out_freq_constraint       = &_pll_pqr_freq_out_constraint,
};

