MichelRottleuthner/RIOT/cpu/stm32/gclk/gclk_stm32l4.c
const gclk_clk_scaler_ll_t gclk_stm32_pllsai1_q_scaler = {
GCLK_GATEABLE_DIV_SCALER_STATIC_INIT(PLLSAI1_Q,
                                     &gclk_stm32_pllsai1_vco_scaler.base,
                                     GCLK_STM32_RCC_PLLSAI1CFGR,
                                     RCC_PLLSAI1CFGR_PLLSAI1QEN_Pos, /* PLLSAI1CFGR[20] (PLLSAI1QEN) */
                                     GCLK_STM32_RCC_PLLSAI1CFGR,
                                     RCC_PLLSAI1CFGR_PLLSAI1Q_Msk), /* PLLSAI1Q[1:0] (PLLSAI1CFGR[22:21]) */
GCLK_LIST8_STATIC_INIT(_pll_qr_div_confs),
    .base.flags.topology_flags = GCLK_STOP_PARENT_FOR_UPDATE,
    //.out_freq_constraint       = &_pll_pqr_freq_out_constraint,
};

const gclk_clk_scaler_ll_t gclk_stm32_pllsai1_r_scaler = {
GCLK_GATEABLE_DIV_SCALER_STATIC_INIT(PLLSAI1_R,
                                     &gclk_stm32_pllsai1_vco_scaler.base,
                                     GCLK_STM32_RCC_PLLSAI1CFGR,
                                     RCC_PLLSAI1CFGR_PLLSAI1REN_Pos, /* PLLSAI1CFGR[24] (PLLSAI1REN) */
                                     GCLK_STM32_RCC_PLLSAI1CFGR,
                                     RCC_PLLSAI1CFGR_PLLSAI1R_Msk), /* PLLSAI1R[1:0] (PLLSAI1CFGR[26:25]) */
GCLK_LIST8_STATIC_INIT(_pll_qr_div_confs),
    .base.flags.topology_flags = GCLK_STOP_PARENT_FOR_UPDATE,
    //.out_freq_constraint       = &_pll_pqr_freq_out_constraint,
};

const gclk_clk_scaler_ll_t gclk_stm32_pllsai2_r_scaler = {
GCLK_GATEABLE_DIV_SCALER_STATIC_INIT(PLLSAI2_R,
                                     &gclk_stm32_pllsai2_vco_scaler.base,
                                     GCLK_STM32_RCC_PLLSAI2CFGR,
                                     RCC_PLLSAI2CFGR_PLLSAI2REN_Pos, /* PLLSAI2CFGR[24] (PLLSAI2REN) */
                                     GCLK_STM32_RCC_PLLSAI2CFGR,
                                     RCC_PLLSAI2CFGR_PLLSAI2R_Msk), /* PLLSAI2R[1:0] (PLLSAI2CFGR[26:25]) */
GCLK_LIST8_STATIC_INIT(_pll_qr_div_confs),
    .base.flags.topology_flags = GCLK_STOP_PARENT_FOR_UPDATE,
    //.out_freq_constraint       = &_pll_pqr_freq_out_constraint,
};

const gclk_clk_scaler_ll_t gclk_stm32_pll_vco_scaler = {
GCLK_GATEABLE_MUL_SCALER_STATIC_INIT(PLL_VCO,
                                     &gclk_stm32_pll_m_scaler.base,
                                     GCLK_STM32_RCC_CR,
                                     RCC_CR_PLLON_Pos, /* RCC_CR[24] PLLON */
                                     GCLK_STM32_RCC_CR,
                                     RCC_CR_PLLRDY_Pos, /*RCC_CR[25] PLLRDY */
                                     GCLK_STM32_RCC_PLLCFGR,
                                     RCC_PLLCFGR_PLLN_Msk), /* PLLN[6:0] (PLLCFGR[14:8]) */
GCLK_REGVAL_AS_NUMVAL_RANGE8_STATIC_INIT(_pll_n_factor_range),
    .base.flags.topology_flags = GCLK_STOP_FOR_UPDATE,
    //.out_freq_constraint       = &_vco_freq_out_constraint,
};

const gclk_clk_scaler_ll_t gclk_stm32_pllsai1_vco_scaler = {
GCLK_GATEABLE_MUL_SCALER_STATIC_INIT(PLLSAI1_VCO,
                                     &gclk_stm32_pll_m_scaler.base,
                                     GCLK_STM32_RCC_CR,
                                     RCC_CR_PLLSAI1ON_Pos,  /* RCC_CR[26] PLLSAI1ON */
                                     GCLK_STM32_RCC_CR,
                                     RCC_CR_PLLSAI1RDY_Pos, /* RCC_CR[27] PLLSAI1RDY */
                                     GCLK_STM32_RCC_PLLSAI1CFGR,
                                     RCC_PLLSAI1CFGR_PLLSAI1N_Msk), /* PLLN[6:0] (PLLSAI1CFGR[14:8]) */
GCLK_REGVAL_AS_NUMVAL_RANGE8_STATIC_INIT(_pll_n_factor_range),
    .base.flags.topology_flags = GCLK_STOP_FOR_UPDATE,
    //.out_freq_constraint       = &_vco_freq_out_constraint,
};

const gclk_clk_scaler_ll_t gclk_stm32_pllsai2_vco_scaler = {
GCLK_GATEABLE_MUL_SCALER_STATIC_INIT(PLLSAI2_VCO,
                                     &gclk_stm32_pll_m_scaler.base,
                                     GCLK_STM32_RCC_CR,
                                     RCC_CR_PLLSAI2ON_Pos, /* RCC_CR[28] PLLSAI2ON */
                                     GCLK_STM32_RCC_CR,
                                     RCC_CR_PLLSAI2RDY_Pos, /* RCC_CR[29] PLLSAI2RDY */
                                     GCLK_STM32_RCC_PLLSAI2CFGR,
                                     RCC_PLLSAI2CFGR_PLLSAI2N_Msk), /* PLLN[6:0] (PLLSAI2CFGR[14:8]) */
GCLK_REGVAL_AS_NUMVAL_RANGE8_STATIC_INIT(_pll_n_factor_range),
    .base.flags.topology_flags = GCLK_STOP_FOR_UPDATE,
    //.out_freq_constraint       = &_vco_freq_out_constraint,
};

uint32_t apb12_post_mul_cross_ref_factor_luf(const gclk_t *clk, const clk_topology_entry_t *other_clock_conf) {
    if (other_clock_conf) {
        return other_clock_conf->factor == 1 ? 1 : 2;
    } else {
        return gclk_get_current_factor(clk->factor_mapping.cross_ref->ref_clk) == 1 ? 1 : 2;
    }
}

const gclk_reg_val_cross_ref_luf_t _apb1_postmul_luf = {
    .ref_clk = &gclk_stm32_apb1_scaler.base,
    .luf = &apb12_post_mul_cross_ref_factor_luf,
};

const gclk_reg_val_cross_ref_luf_t _apb2_postmul_luf = {
    .ref_clk = &gclk_stm32_apb2_scaler.base,
    .luf = &apb12_post_mul_cross_ref_factor_luf,
};

/* NOTE: For clocks like this one, i.e., ones that strictly depend on other clock nodes, there are a few things to consider:
 *       - Exploration that is purely based on numerical factor representation (without a global tree model view) its
 *         configuration could be represented by a symbolic value. This may then be treated in one of the following ways:
 *          - "don't know beforehand what the hardware will do"
 *          - "finitie number of all possible states" (allows to check for possible conflicts, but may gives false positives) 
 *          - "value must be converted from symbolic to specific in a post processing step that uses platform specific
 *             dependency-description-constraints that resolve undefined state based on the respecitve state of the rest of the tree"
 *
 * this scaler multiplies the APB1 (PCLK1) clock by a fixed factor of 1 or 2 depending on the actual APB1 prescaler value.
 * If the APB prescaler is set to 1 this clock has the same frequency as APB1. Otherwise it uses twice the frequency of APB.
 * This is enforced by hardware and can not be changed by the user.
 * See reference manual page 214 section 6.2.15 (Timer Clock) for more details.
 * Since it directly depends on the APB1 config, we use the same configuration register but another GCLK_CONF_LUT */
const gclk_clk_scaler_ll_t gclk_apb1_tim_mul_scaler = {
GCLK_CONDITONAL_MUL_SCALER_STATIC_INIT(APB1{x1|x2},
                                  &gclk_stm32_apb1_scaler.base,
                                  GCLK_STM32_RCC_CFGR,
                                  RCC_CFGR_PPRE1_Msk), /* PPRE1[2:0] (CFGR[10:8]) */
GCLK_FACTOR_CROSSREF_UPTREE_LUF_STATIC_INIT(_apb1_postmul_luf),
};

/* this scaler multiplies the APB2 clock by a fixed factor of 1 or 2 depending on the actual APB2 prescaler value.
   This is enforced by hardware and can not be changed by the user.
   Since it directly depends on the APB2 config, we use the same configuration register but another GCLK_CONF_LUT */
const gclk_clk_scaler_ll_t gclk_apb2_tim_mul_scaler = {
GCLK_CONDITONAL_MUL_SCALER_STATIC_INIT(APB2{x1|x2},
                                       &gclk_stm32_apb2_scaler.base,
                                       GCLK_STM32_RCC_CFGR,
                                       RCC_CFGR_PPRE2_Msk), /* PPRE2[2:0] (CFGR[13:11]) */
GCLK_FACTOR_CROSSREF_UPTREE_LUF_STATIC_INIT(_apb2_postmul_luf),
};

/* TODO a static scaler is just metadata ontop of another clock */
const gclk_clk_scaler_ll_t gclk_stm32_hse_div32_scaler = {
GCLK_PLAIN_FIXED_SCALER_STATIC_INIT(HSE/32, 32),
    .base.fixed_parent       = &gclk_stm32_hse_gate.base,
    .base.flags.scaler_type  = GCLK_DIV,
};

const gclk_clk_scaler_ll_t gclk_stm32_ahb_div8_scaler = {
GCLK_PLAIN_FIXED_SCALER_STATIC_INIT(AHB/8, 8),
    .base.fixed_parent       = &gclk_stm32_ahb_scaler.base,
    .base.flags.scaler_type  = GCLK_DIV,
};

int gclk_enable_pin_output(const gclk_t *clk, const gpio_t pin) {
    if (clk == &gclk_stm32_mco_div_scaler.base) {
        if (pin == STM32_L476RG_MCO_PIN) {
            gpio_init(STM32_L476RG_MCO_PIN, GPIO_OUT);
            gpio_init_af(STM32_L476RG_MCO_PIN, STM32_L476RG_MCO_AF);
            return ENABLE_PIN_OUTPUT_OK;
        }
        return ENABLE_PIN_OUTPUT_INVALID_PIN;
    }

    return ENABLE_PIN_OUTPUT_INVALID_CLOCK;
}


/* @todo rework the access to clock nodes externally defined in other files.
   Currently there is no way to just hand over the generic gclk_t reference without the specific type because the
   compiler wont see the value of the const pointer to a const struct as a *constant value*, thus we cannot use it as
   initializer (e.g. as fixed parent, or parent option).
   Two things to potentially improve here:
   1: use enum IDs to index the various clock instances (also conditionally provide the enum IDs)
   2: provide such an array on a per-file basis with a "next_list" pointer and keep a gobal count in the gclk module */

