MichelRottleuthner/RIOT/cpu/stm32/gclk/gclk_stm32l4.c
const gclk_t * const gclks[] = {
#if defined(CPU_FAM_STM32L0)
    &gclk_stm32_ahb_scaler.base,
    &gclk_stm32_apb1_scaler.base,
    &gclk_stm32_apb2_scaler.base,
    &gclk_stm32_pll_div_scaler.base,
    &gclk_stm32_pll_usb_div_scaler.base,
    &gclk_stm32_pll_mul_scaler.base,
    &gclk_apb1_tim_mul_scaler.base,
    &gclk_apb2_tim_mul_scaler.base,
    &gclk_stm32_hse_div_scaler.base,
    &gclk_stm32_ahb_div8_scaler.base,
    &gclk_stm32_msirange_scaler.base,
    &gclk_stm32_mco_div_scaler.base,
    &gclk_stm32_hsi16_div_scaler.base,
    &gclk_stm32_sysclk_mux.base,
    &gclk_stm32_hsi48_mux.base,
    &gclk_stm32_rtc_lcd_mux.base,
    &gclk_stm32_pll_src_mux.base,
    &gclk_stm32_mco_mux.base,
    &gclk_stm32_i2c1_mux.base,
    &gclk_stm32_i2c3_mux.base,
    &gclk_stm32_lpuart1_mux.base,
    &gclk_stm32_usart2_mux.base,
    &gclk_stm32_usart1_mux.base,
    &gclk_stm32_lptim1_mux.base,
    &gclk_stm32_hsi16_gate.base,
    &gclk_stm32_hse_gate.base,
    &gclk_stm32_lse_gate.base,
    &gclk_stm32_lsi_gate.base,
    &gclk_stm32_msi_base,
    &gclk_stm32_msi_gate.base,
    &gclk_stm32_hsi48_gate.base,
#elif defined(CPU_FAM_STM32L4)
    &gclk_stm32_sysclk_mux.base,
    &gclk_stm32_msi_mux.base,
    &gclk_stm32_usb_rng_sdmmc_mux.base,
    &gclk_stm32_lsco_mux.base,
    &gclk_stm32_rtc_lcd_mux.base,
    &gclk_stm32_pll_pre_div_mux.base,
    &gclk_stm32_sai1_mux.base,
    &gclk_stm32_sai2_mux.base,
    &gclk_stm32_mco_mux.base,
    &gclk_stm32_adc_mux.base,
    &gclk_stm32_i2c1_mux.base,
    &gclk_stm32_i2c2_mux.base,
    &gclk_stm32_i2c3_mux.base,
    &gclk_stm32_dfsdm1_mux.base,
    &gclk_stm32_lpuart1_mux.base,
    &gclk_stm32_uart5_mux.base,
    &gclk_stm32_uart4_mux.base,
    &gclk_stm32_usart3_mux.base,
    &gclk_stm32_usart2_mux.base,
    &gclk_stm32_usart1_mux.base,
    &gclk_stm32_swpmi1_mux.base,
    &gclk_stm32_lptim1_mux.base,
    &gclk_stm32_lptim2_mux.base,
    &gclk_stm32_ahb_scaler.base,
    &gclk_stm32_apb1_scaler.base,
    &gclk_stm32_apb2_scaler.base,
    &gclk_stm32_pll_m_scaler.base,
    &gclk_stm32_pll_p_scaler.base,
    &gclk_stm32_pllsai1_p_scaler.base,
    &gclk_stm32_pllsai2_p_scaler.base,
    &gclk_stm32_pll_p_scaler.base,
    &gclk_stm32_pllsai1_q_scaler.base,
    &gclk_stm32_pll_q_scaler.base,
    &gclk_stm32_pll_r_scaler.base,
    &gclk_stm32_pll_q_scaler.base,
    &gclk_stm32_pllsai1_r_scaler.base,
    &gclk_stm32_pllsai2_r_scaler.base,
    &gclk_stm32_pll_vco_scaler.base,
    &gclk_stm32_pllsai1_vco_scaler.base,
    &gclk_stm32_pllsai2_vco_scaler.base,
    &gclk_apb1_tim_mul_scaler.base,
    &gclk_apb2_tim_mul_scaler.base,
    &gclk_stm32_hse_div32_scaler.base,
    &gclk_stm32_ahb_div8_scaler.base,
    &gclk_stm32_msirange_scaler.base,
    &gclk_stm32_msisrange_scaler.base,
    &gclk_stm32_mco_div_scaler.base,
    &gclk_stm32_msi_gate.base,
    &gclk_stm32_sai1_ext,
    &gclk_stm32_sai2_ext,
    &gclk_stm32_hsi16_gate.base,
    &gclk_stm32_hse_gate.base,
    &gclk_stm32_lse_gate.base,
    &gclk_stm32_lsi_gate.base,
    &gclk_stm32_msi_base,
    &gclk_stm32_tim5_gate.base,
#endif
};

//gclk_t const *gclock_core_clock_handle = &gclk_stm32_sysclk_mux.base;
// should actually be this:gclk_t const *gclock_handle_for_core_freq = &gclk_stm32_ahb_scaler.base;
// MSI is probably used instead to expresss "control core clock via MSI
